using System;
using System.Collections.Generic;
using System.Text;

namespace Utilities
{
   public class RandomGenerator
    {
        static String[] chinaFamilyName = {  
        "赵", "钱", "孙", "李", "周", "吴", "郑", "王",  
        "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨",  
        "朱", "秦", "尤", "许", "何", "吕", "施", "张",  
        "孔", "曹", "严", "华", "金", "魏", "陶", "姜",  
        "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",  
        "云", "苏", "潘", "葛", "奚", "范", "彭", "郎",  
        "鲁", "韦", "昌", "马", "苗", "凤", "花", "方",  
        "俞", "任", "袁", "柳", "丰", "鲍", "史", "唐",  
        "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤",  
        "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",  
        "乐", "于", "时", "傅", "皮", "卞", "齐", "康",  
        "伍", "余", "元", "卜", "顾", "孟", "平", "黄",  
        "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪",  
        "祁", "毛", "禹", "狄", "米", "贝", "明", "臧",  
        "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",  
        "熊", "纪", "舒", "屈", "项", "祝", "董", "梁",  
        "杜", "阮", "蓝", "闵", "席", "季", "麻", "强",  
        "贾", "路", "娄", "危", "江", "童", "颜", "郭",  
        "梅", "盛", "林", "刁", "钟", "徐", "丘", "骆",  
        "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",  
        "虞", "万", "支", "柯", "昝", "管", "卢", "莫",  
        "经", "房", "裘", "缪", "干", "解", "应", "宗",  
        "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪",  
        "包", "诸", "左", "石", "崔", "吉", "钮", "龚",  
        "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁",  
        "荀", "羊", "於", "惠", "甄", "麴", "家", "封",  
        "芮", "羿", "储", "靳", "汲", "邴", "糜", "松",  
        "井", "段", "富", "巫", "乌", "焦", "巴", "弓",  
        "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬",  
        "全", "郗", "班", "仰", "秋", "仲", "伊", "宫",  
        "宁", "仇", "栾", "暴", "甘", "钭", "厉", "戌",  
        "祖", "武", "符", "刘", "景", "詹", "束", "龙",  
        "叶", "幸", "司", "韶", "郜", "黎", "蓟", "薄",  
        "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂",  
        "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙",  
        "池", "乔", "阴", "郁", "胥", "能", "苍", "双",  
        "闻", "莘", "党", "翟", "谭", "贡", "劳", "逢",  
        "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍",  
        "郤", "璩", "桑", "桂", "濮", "牛", "寿", "通",  
        "边", "扈", "燕", "冀", "郏", "浦", "尚", "农",  
        "温", "别", "庄", "晏", "柴", "瞿", "阎", "充",  
        "慕", "连", "茹", "习", "宦", "艾", "鱼", "容",  
        "向", "古", "易", "慎", "戈", "廖", "庾", "终",  
        "暨", "居", "衡", "步", "都", "耿", "满", "弘",  
        "匡", "国", "文", "寇", "广", "禄", "阙", "东",  
        "欧", "殳", "沃", "利", "蔚", "越", "菱", "隆",  
        "师", "巩", "厍", "聂", "晃", "勾", "敖", "融",  
        "冷", "訾", "辛", "阚", "那", "简", "饶", "空",  
        "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰",  
        "巢", "关", "蒯", "相", "查", "后", "荆", "红",  
        "游竺", "权逯", "盖益", "桓公", "万俟", "司马", "上官", "欧阳",  
        "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫", "尉迟", "公羊",  
        "澹台", "公冶", "宗政", "濮阳", "淳于", "单于", "太叔", "申屠",  
        "公孙", "仲孙", "轩辕", "令狐", "钟离", "宇文", "长孙", "慕容",  
        "鲜于", "闾丘", "司徒", "司空", "亓官", "司寇", "仉督", "子车",  
        "颛孙", "端木", "巫马", "公西", "漆雕", "乐正", "壤驷", "公良",  
        "拓跋", "夹谷", "宰父", "谷粱", "晋楚", "闫法", "汝鄢", "涂钦",  
        "段干", "百里", "东郭", "南门", "呼延", "归海", "羊舌", "微生",  
        "岳帅", "缑亢", "况郈", "有琴", "梁丘", "左丘", "东门", "西门",  
        "商牟", "佘佴", "伯赏", "南宫", "墨哈", "谯笪", "年爱", "阳佟",  
        "第五", "言福",  
        };
        static string[] englishChar = { "a", "b", "c", "d", "e", "f" ,
                                        "g", "h", "i", "j", "k", "l" ,
                                        "m", "n", "o", "p", "q", "r" ,
                                        "s", "t", "w", "v", "u", "x" ,
                                        "y", "z"};
        static string[] numeric = { "1", "2", "3", "4", "5", "6", 
                                    "7", "8", "9", "0"};
        static string[] symbols = { "~", "!", "@", "#", "$", "%", 
                                    "^", "&", "*", "(",")","_"};

        static Random random = new Random();
        static maker make = new maker();

        public static String GenerateRandomChinese(int length)
        {
            if (length == 0)
            {
                return "";
            }

            String fmName = chinaFamilyName[getRandom().Next(chinaFamilyName.Length / 2)];
            if (length == 1)
            {
                return fmName;
            }
            return fmName + GetRandomChinese(length - 1);
            
        }
        private static String getChinaName()
        {

            String fmName = chinaFamilyName[getRandom().Next(chinaFamilyName.Length/2)];
            return fmName + GetRandomChinese(2);
        }
       public static Random getRandom()
       {
           Guid randSeedGuid = Guid.NewGuid();
           Random random = new Random(BitConverter.ToInt32(randSeedGuid.ToByteArray(), 0));
           return random;
       }
       private static string GetRandomChinese(int strlength)
        {
            // 获取GB2312编码页（表）
            Encoding gb = Encoding.GetEncoding("gb2312");

            object[] bytes = CreateRegionCode(strlength);

            StringBuilder sb = new StringBuilder();

            for (int i = 0; i < strlength; i++)
            {
                string temp = gb.GetString((byte[])Convert.ChangeType(bytes[i], typeof(byte[])));
                sb.Append(temp);
            }

            return sb.ToString();
        }
        private static object[] CreateRegionCode(int strlength)
        {
            //定义一个字符串数组储存汉字编码的组成元素
            string[] rBase = new String[16] { "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "a", "b", "c", "d", "e", "f" };

            Random rnd = new Random();

            //定义一个object数组用来
            object[] bytes = new object[strlength];

            /**
             每循环一次产生一个含两个元素的十六进制字节数组，并将其放入bytes数组中
             每个汉字有四个区位码组成
             区位码第1位和区位码第2位作为字节数组第一个元素
             区位码第3位和区位码第4位作为字节数组第二个元素
            **/
            for (int i = 0; i < strlength; i++)
            {
                //区位码第1位
                int r1 = rnd.Next(11, 14);
                string str_r1 = rBase[r1].Trim();

                //区位码第2位
                rnd = getRandom(); // 更换随机数发生器的 种子避免产生重复值
                int r2;
                if (r1 == 13)
                {
                    r2 = rnd.Next(0, 7);
                }
                else
                {
                    r2 = rnd.Next(0, 16);
                }
                string str_r2 = rBase[r2].Trim();

                //区位码第3位
                rnd = new Random(r2 * unchecked((int)DateTime.Now.Ticks) + i);
                int r3 = rnd.Next(10, 16);
                string str_r3 = rBase[r3].Trim();

                //区位码第4位
                rnd = new Random(r3 * unchecked((int)DateTime.Now.Ticks) + i);
                int r4;
                if (r3 == 10)
                {
                    r4 = rnd.Next(1, 16);
                }
                else if (r3 == 15)
                {
                    r4 = rnd.Next(0, 15);
                }
                else
                {
                    r4 = rnd.Next(0, 16);
                }
                string str_r4 = rBase[r4].Trim();

                // 定义两个字节变量存储产生的随机汉字区位码
                byte byte1 = Convert.ToByte(str_r1 + str_r2, 16);
                byte byte2 = Convert.ToByte(str_r3 + str_r4, 16);
                // 将两个字节变量存储在字节数组中
                byte[] str_r = new byte[] { byte1, byte2 };

                // 将产生的一个汉字的字节数组放入object数组中
                bytes.SetValue(str_r, i);
            }
            return bytes;
        }

        static private string getRandomChar()
        {
            return englishChar[getRandom().Next(26)];
        }
        static private string getRandomNum()
        {
            return numeric[getRandom().Next(10)];
        }

        static public string GenerateRandomNum(int length)
        {
            if (length == 0)
            {
                return "";
            }
            StringBuilder builder = new StringBuilder(length);
            for (int i = 0; i < length;i++ )
            {
                builder.Append(getRandomNum());
            }
            return builder.ToString();
        }
       // rate数字的比例
        static public string GenerateEnName(int length, double rate)
        {
            if (length == 0)
            {
                return "";
            }
            StringBuilder builder = new StringBuilder(length+1);
            builder.Append(englishChar[getRandom().Next(26)]);
            int iRate = (int)rate * 10;
            for (int i = 0; i < length - 1; i++)
            {
                if (getRandom().Next(10) < rate)
                    builder.Append(getRandomNum());
                else
                    builder.Append(getRandomChar());
            }
            return builder.ToString();
        }
        // 产生一个随机的用户名
        static public string getRandomName()
        {
            return getChinaName();
        }
        static public string getRandomMixUserName()
        {
            int baseLenght = 5;
            int enCnt = getRandom().Next(TBConfig.getInstance().enCount);
            if (enCnt == 0)
            {
                enCnt = getRandom().Next(TBConfig.getInstance().enCount);
            }
            int numCnt = getRandom().Next(TBConfig.getInstance().numCount);
            string rntName = make.makeRealNames() + getRandomMixEnAndNum(baseLenght+enCnt, numCnt);
            return rntName;
        }
        // 产生一个随机的密码
        static public string getRandomPwd(int length = 15)
        {
            length = TBConfig.getInstance().pwdLenght;
            StringBuilder builder = new StringBuilder(length + 1);
            builder.Append(englishChar[getRandom().Next(26)]);
            int iRate = 3;
            int iUpper = 6;
            List<int> sysIndexs = new List<int>();
            int symbolscnt = TBConfig.getInstance().symbolsCnt;
            for (int i = 0; i < symbolscnt; i++)
            {
                sysIndexs.Add(getRandom().Next(length));
            }
            for (int i = 0; i < length - 1; i++)
            {
                if (sysIndexs.Contains(i))
                {
                    builder.Append(getRandomSymbol());
                    continue;
                }
                int num = getRandom().Next(10);
                if ( num <= iRate)//数字
                    builder.Append(getRandomNum());
                else if (num <= iUpper && num > iRate)//大写
                {
                    builder.Append(getRandomChar().ToUpper());
                }
                else
                {
                    builder.Append(getRandomChar());
                }
                    
            }
            return builder.ToString();
        }
       // 产生一个随机的英文名
        static public string getRandomEnName(int length)
        {
            return GenerateEnName(length, 0.3);
        }
       // 产生一个英文和数字的组合
       static public string getRandomMixEnAndNum(int enCnt, int numCnt)
        {
            int totalLen = enCnt+numCnt;
            StringBuilder builder = new StringBuilder(totalLen+1);
            List<int> enList = new List<int>();
            for (int i = 0; i < enCnt; i++ )
            {
                enList.Add(getRandom().Next(totalLen));
            }
            int rand = getRandom().Next(enCnt);
            if (rand == 1 || rand ==0)
            {
               rand = 2;
            }
            for (int k = 0; k < totalLen; k++ )
            {
                if (enList.Contains(k))
                {
                    string ch = getRandomChar();
                    if ((k % rand) == 0)
                    {
                        ch = ch.ToUpper();
                    }
                    builder.Append(ch);
                }
                else
                    builder.Append(getRandomNum());
            }
            return builder.ToString();
        }
       static public string getRandomEnName()
       {
           return GenerateEnName(8, 0.3);
       }
       static public string getRandomSymbol()
       {
           return symbols[getRandom().Next(12)];
       }
    }

   public class maker
   {
       public string help { set; get; }
       public string CnlastNames { set; get; }
       public maker()
       {
           //帮助文档:
           help = @"

            //添加DLL引用之后,再添加程序集引用:using makeName;
            maker x = new maker();  //建立类实例;
            //Console.WriteLine(x.help); //获取帮助文档; 
            //Console.WriteLine(x.makeRndCnWords(100));//生成100个随机汉字;
            //Console.WriteLine(x.makeRealNames(100)); //生成100个高仿真姓名;           
            //Console.WriteLine(x.makeRealOrgNames(100)); //生成100个高仿真单位或机构名;
            //Console.WriteLine(x.makeGBKNamesBy3755(100,""项"")); //生成100个一级GBK姓名; 
            //Console.WriteLine(x.makeGBKNamesBy3008(100,""项"")); //生成100个二级GBK姓名;  
            //Console.WriteLine(x.makeUnicodeNames(100,""项"")); //生成100个Unicode姓名; 
            //Console.WriteLine(x.CnlastNames); //输出中国姓氏;
            Console.ReadKey();

            ";

           //中国姓氏:
           CnlastNames = "王陈张李周杨吴黄刘徐朱胡沈潘章程方孙郑金叶汪何马赵林蒋俞姚许丁施高余谢董汤钱卢江蔡宋曹邱罗杜郭戴洪唐袁夏童肖姜傅范顾梅盛吕诸邵陆彭韩倪雷郎梁楼万龚储鲍严葛华应冯项崔魏毛阮邹喻曾邓熊任陶费凌虞裘涂苏翁莫卞史季康管黎孔田单娄宣钟饶鲁廖于韦甘石孟柳祝胥殷舒褚薛白向邬尚竺查谈贾温游谭开伍庄成沙柏郝秦尉麻詹赖裴颜尹巴乐厉谷易段钮骆笪阎缪臧樊操卜丰文水兰包平乔伊有牟邢劳来求沃芮闵欧郏柯贺闻桂耿戚符蓝路阚滕霍上卫干支牛计车左申艾仲刑匡印吉宇安戎毕池纪过佘冷时束花迟邰卓宓宗官庞於明练苗茅郁冒洑相郤郦钦奚席晋晏柴聂宿密屠常鄂惠琚窦简蒿阙穆濮";
       }

       //按Unicode编码取出随机汉字:
       public string makeRndCnWords(int k)
       {
           string rs = "";
           Random rd = RandomGenerator.getRandom();
           for (int i = 0; i < k; i++)
           {
               rs += (char)rd.Next(0x4E00, 0x9FA5);
           }
           return rs;

       }

       //生成高仿真姓名:
       public string makeRealNames(int k)
       {
           string rs = ""; string ln = "";
           string x = @"王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏童童童童童童童童童童童童童童童童童童童童童童童童童童肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅范范范范范范范范范范范范范范范范范范范范范范范范顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼万万万万万万万万万万万万万万万万万万龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚储储储储储储储储储储储储储储储储储储鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍严严严严严严严严严严严严严严严严严葛葛葛葛葛葛葛葛葛葛葛葛葛葛葛葛葛华华华华华华华华华华华华华华华华应应应应应应应应应应应应应应应应冯冯冯冯冯冯冯冯冯冯冯冯冯冯冯项项项项项项项项项项项项项项项崔崔崔崔崔崔崔崔崔崔崔崔崔崔崔魏魏魏魏魏魏魏魏魏魏魏魏魏魏魏毛毛毛毛毛毛毛毛毛毛毛毛毛毛阮阮阮阮阮阮阮阮阮阮阮阮阮阮邹邹邹邹邹邹邹邹邹邹邹邹邹邹喻喻喻喻喻喻喻喻喻喻喻喻喻喻曾曾曾曾曾曾曾曾曾曾曾曾曾曾邓邓邓邓邓邓邓邓邓邓邓邓邓熊熊熊熊熊熊熊熊熊熊熊熊熊任任任任任任任任任任任任陶陶陶陶陶陶陶陶陶陶陶陶费费费费费费费费费费费凌凌凌凌凌凌凌凌凌凌凌虞虞虞虞虞虞虞虞虞虞虞裘裘裘裘裘裘裘裘裘裘裘涂涂涂涂涂涂涂涂涂涂苏苏苏苏苏苏苏苏苏翁翁翁翁翁翁翁翁翁莫莫莫莫莫莫莫莫莫卞卞卞卞卞卞卞卞史史史史史史史史季季季季季季季季康康康康康康康康管管管管管管管管黎黎黎黎黎黎黎黎孔孔孔孔孔孔孔田田田田田田田单单单单单单单娄娄娄娄娄娄娄宣宣宣宣宣宣宣钟钟钟钟钟钟钟饶饶饶饶饶饶饶鲁鲁鲁鲁鲁鲁鲁廖廖廖廖廖廖廖于于于于于于韦韦韦韦韦韦甘甘甘甘甘甘石石石石石石孟孟孟孟孟孟柳柳柳柳柳柳祝祝祝祝祝祝胥胥胥胥胥胥殷殷殷殷殷殷舒舒舒舒舒舒褚褚褚褚褚褚薛薛薛薛薛薛白白白白白向向向向向邬邬邬邬邬尚尚尚尚尚竺竺竺竺竺查查查查查谈谈谈谈谈贾贾贾贾贾温温温温温游游游游游谭谭谭谭谭开开开开伍伍伍伍庄庄庄庄成成成成沙沙沙沙柏柏柏柏郝郝郝郝秦秦秦秦尉尉尉尉麻麻麻麻詹詹詹詹赖赖赖赖裴裴裴裴颜颜颜颜尹尹尹巴巴巴乐乐乐厉厉厉谷谷谷易易易段段段钮钮钮骆骆骆笪笪笪阎阎阎缪缪缪臧臧臧樊樊樊操操操卜卜丰丰文文水水兰兰包包平平乔乔伊伊有有牟牟邢邢劳劳来来求求沃沃芮芮闵闵欧欧郏郏柯柯贺贺闻闻桂桂耿耿戚戚符符蓝蓝路路阚阚滕滕霍霍上卫干支牛计车左申艾仲刑匡印吉宇安戎毕池纪过佘冷时束花迟邰卓宓宗官庞於明练苗茅郁冒洑相郤郦钦奚席晋晏柴聂宿密屠常鄂惠琚窦简蒿阙穆濮";
           string m = @"华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋世世世世世世世世世世世世世世世世世世世世世世世世世世世世世世世有有有有有有有有有有有有有有有有有有有有有有有有有有有有有有有佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳立立立立立立立立立立立立立立立立立立立立立立立立立立立立立立家家家家家家家家家家家家家家家家家家家家家家家家家家家家家家清清清清清清清清清清清清清清清清清清清清清清清清清清清清清清义义义义义义义义义义义义义义义义义义义义义义义义义义义义义丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹正正正正正正正正正正正正正正正正正正正正正正正正正正正正正宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳银银银银银银银银银银银银银银银银银银银银银银银银银银银银银贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤培培培培培培培培培培培培培培培培培培培培培培培培培培培培锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋中中中中中中中中中中中中中中中中中中中中中中中中中中中仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁元元元元元元元元元元元元元元元元元元元元元元元元元元元香香香香香香香香香香香香香香香香香香香香香香香香香香香长长长长长长长长长长长长长长长长长长长长长长长长长长如如如如如如如如如如如如如如如如如如如如如如如如如如花花花花花花花花花花花花花花花花花花花花花花花花花花才才才才才才才才才才才才才才才才才才才才才才才才才友友友友友友友友友友友友友友友友友友友友友友友友友刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚利利利利利利利利利利利利利利利利利利利利利利利利利连连连连连连连连连连连连连连连连连连连连连连连连连东东东东东东东东东东东东东东东东东东东东东东东东江江江江江江江江江江江江江江江江江江江江江江江江洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜君君君君君君君君君君君君君君君君君君君君君君君昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊星星星星星星星星星星星星星星星星星星星星星星星光光光光光光光光光光光光光光光光光光光光光光波波波波波波波波波波波波波波波波波波波波波波顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷一一一一一一一一一一一一一一一一一一一一一和和和和和和和和和和和和和和和和和和和和和康康康康康康康康康康康康康康康康康康康康康吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙发发发发发发发发发发发发发发发发发发发杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉静静静静静静静静静静静静静静静静静静静传传传传传传传传传传传传传传传传传传欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵振振振振振振振振振振振振振振振振振振维维维维维维维维维维维维维维维维维维晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉双双双双双双双双双双双双双双双双双方方方方方方方方方方方方方方方方方礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼松松松松松松松松松松松松松松松松松彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑来来来来来来来来来来来来来来来来涛涛涛涛涛涛涛涛涛涛涛涛涛涛涛涛素素素素素素素素素素素素素素素素莹莹莹莹莹莹莹莹莹莹莹莹莹莹莹莹超超超超超超超超超超超超超超超超木木木木木木木木木木木木木木木芸芸芸芸芸芸芸芸芸芸芸芸芸芸芸武武武武武武武武武武武武武武武浩浩浩浩浩浩浩浩浩浩浩浩浩浩浩道道道道道道道道道道道道道道道天天天天天天天天天天天天天天冬冬冬冬冬冬冬冬冬冬冬冬冬冬巧巧巧巧巧巧巧巧巧巧巧巧巧巧先先先先先先先先先先先先先先宗宗宗宗宗宗宗宗宗宗宗宗宗宗泽泽泽泽泽泽泽泽泽泽泽泽泽泽娜娜娜娜娜娜娜娜娜娜娜娜娜娜虹虹虹虹虹虹虹虹虹虹虹虹虹虹能能能能能能能能能能能能能能善善善善善善善善善善善善善善瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫开开开开开开开开开开开开开加加加加加加加加加加加加加汉汉汉汉汉汉汉汉汉汉汉汉汉全全全全全全全全全全全全全远远远远远远远远远远远远远坤坤坤坤坤坤坤坤坤坤坤坤坤炎炎炎炎炎炎炎炎炎炎炎炎炎树树树树树树树树树树树树树泉泉泉泉泉泉泉泉泉泉泉泉泉珏珏珏珏珏珏珏珏珏珏珏珏珏继继继继继继继继继继继继继高高高高高高高高高高高高高鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿景景景景景景景景景景景景景为为为为为为为为为为为为叶叶叶叶叶叶叶叶叶叶叶叶宇宇宇宇宇宇宇宇宇宇宇宇年年年年年年年年年年年年孝孝孝孝孝孝孝孝孝孝孝孝寿寿寿寿寿寿寿寿寿寿寿寿苗苗苗苗苗苗苗苗苗苗苗苗虎虎虎虎虎虎虎虎虎虎虎虎洁洁洁洁洁洁洁洁洁洁洁洁益益益益益益益益益益益益智智智智智智智智智智智智森森森森森森森森森森森森琼琼琼琼琼琼琼琼琼琼琼琼雅雅雅雅雅雅雅雅雅雅雅雅源源源源源源源源源源源源鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏士士士士士士士士士士士山山山山山山山山山山山丰丰丰丰丰丰丰丰丰丰丰乐乐乐乐乐乐乐乐乐乐乐冰冰冰冰冰冰冰冰冰冰冰克克克克克克克克克克克杏杏杏杏杏杏杏杏杏杏杏定定定定定定定定定定定承承承承承承承承承承承绍绍绍绍绍绍绍绍绍绍绍政政政政政政政政政政政倩倩倩倩倩倩倩倩倩倩倩健健健健健健健健健健健锡锡锡锡锡锡锡锡锡锡锡锦锦锦锦锦锦锦锦锦锦锦黎黎黎黎黎黎黎黎黎黎黎耀耀耀耀耀耀耀耀耀耀耀三三三三三三三三三三阳阳阳阳阳阳阳阳阳阳佩佩佩佩佩佩佩佩佩佩剑剑剑剑剑剑剑剑剑剑姣姣姣姣姣姣姣姣姣姣珊珊珊珊珊珊珊珊珊珊章章章章章章章章章章铭铭铭铭铭铭铭铭铭铭瑞瑞瑞瑞瑞瑞瑞瑞瑞瑞碧碧碧碧碧碧碧碧碧碧翠翠翠翠翠翠翠翠翠翠瑾瑾瑾瑾瑾瑾瑾瑾瑾瑾土土土土土土土土土少少少少少少少少少行行行行行行行行行伯伯伯伯伯伯伯伯伯坚坚坚坚坚坚坚坚坚阿阿阿阿阿阿阿阿阿其其其其其其其其其奇奇奇奇奇奇奇奇奇妹妹妹妹妹妹妹妹妹怡怡怡怡怡怡怡怡怡炜炜炜炜炜炜炜炜炜南南南南南南南南南品品品品品品品品品盛盛盛盛盛盛盛盛盛菲菲菲菲菲菲菲菲菲雄雄雄雄雄雄雄雄雄意意意意意意意意意璐璐璐璐璐璐璐璐璐人人人人人人人人久久久久久久久久大大大大大大大大风风风风风风风风仲仲仲仲仲仲仲仲向向向向向向向向达达达达达达达达启启启启启启启启时时时时时时时时欣欣欣欣欣欣欣欣茂茂茂茂茂茂茂茂钦钦钦钦钦钦钦钦卿卿卿卿卿卿卿卿翔翔翔翔翔翔翔翔九九九九九九九广广广广广广广心心心心心心心代代代代代代代亦亦亦亦亦亦亦存存存存存存存师师师师师师师纪纪纪纪纪纪纪芝芝芝芝芝芝芝李李李李李李李灵灵灵灵灵灵灵纯纯纯纯纯纯纯苏苏苏苏苏苏苏迎迎迎迎迎迎迎秉秉秉秉秉秉秉诚诚诚诚诚诚诚奎奎奎奎奎奎奎娇娇娇娇娇娇娇显显显显显显显祖祖祖祖祖祖祖哲哲哲哲哲哲哲荷荷荷荷荷荷荷基基基基基基基珺珺珺珺珺珺珺琦琦琦琦琦琦琦熙熙熙熙熙熙熙蕾蕾蕾蕾蕾蕾蕾万万万万万万子子子子子子火火火火火火以以以以以以圣圣圣圣圣圣宁宁宁宁宁宁兆兆兆兆兆兆权权权权权权竹竹竹竹竹竹自自自自自自观观观观观观贞贞贞贞贞贞妙妙妙妙妙妙怀怀怀怀怀怀妮妮妮妮妮妮育育育育育育彦彦彦彦彦彦恒恒恒恒恒恒栋栋栋栋栋栋堂堂堂堂堂堂婕婕婕婕婕婕湘湘湘湘湘湘照照照照照照瑜瑜瑜瑜瑜瑜韵韵韵韵韵韵毓毓毓毓毓毓豪豪豪豪豪豪毅毅毅毅毅毅潮潮潮潮潮潮力力力力力之之之之之五五五五五从从从从从升升升升升太太太太太引引引引引业业业业业本本本本本田田田田田名名名名名守守守守守扬扬扬扬扬汝汝汝汝汝百百百百百妍妍妍妍妍岚岚岚岚岚男男男男男财财财财财进进进进进凯凯凯凯凯周周周周周宜宜宜宜宜放放放放放旺旺旺旺旺经经经经经雨雨雨雨雨保保保保保信信信信信娅娅娅娅娅庭庭庭庭庭思思思思思钢钢钢钢钢钧钧钧钧钧凌凌凌凌凌圆圆圆圆圆宽宽宽宽宽宾宾宾宾宾笑笑笑笑笑骏骏骏骏骏跃跃跃跃跃斐斐斐斐斐朝朝朝朝朝煜煜煜煜煜增增增增增震震震震震鹤鹤鹤鹤鹤衡衡衡衡衡艺艺艺艺尔尔尔尔申申申申尧尧尧尧作作作作园园园园声声声声陆陆陆陆卓卓卓卓孟孟孟孟昉昉昉昉治治治治知知知知祎祎祎祎郁郁郁郁钖钖钖钖修修修修复复复复威威威威柏柏柏柏洲洲洲洲相相相相科科科科晋晋晋晋润润润润航航航航莎莎莎莎铁铁铁铁乾乾乾乾晨晨晨晨望望望望梦梦梦梦涵涵涵涵象象象象逸逸逸逸媛媛媛媛敬敬敬敬腊腊腊腊滨滨滨滨雷雷雷雷蔚蔚蔚蔚磊磊磊磊露露露露乃乃乃于于于女女女工工工书书书公公公六六六历历历日日日贝贝贝仕仕仕令令令北北北四四四石石石再再再农农农则则则吕吕吕延延延聿聿聿亨亨亨余余余呈呈呈应应应社社社芹芹芹运运运依依依姐姐姐姗姗姗季季季岩岩岩玥玥玥诗诗诗厚厚厚垚垚垚宣宣宣宪宪宪峥峥峥映映映柱柱柱炼炼炼茹茹茹贻贻贻轶轶轶容容容悦悦悦梧梧梧泰泰泰积积积耕耕耕莺莺莺谊谊谊逢逢逢铃铃铃梓梓梓渊渊渊爽爽爽绪绪绪敦敦敦淼淼淼琪琪琪登登登程程程越越越雁雁雁雯雯雯雲雲雲嵩嵩嵩满满满筠筠筠蓓蓓蓓路路路旗旗旗熊熊熊瑶瑶瑶璋璋璋聪聪聪镕镕镕薇薇薇赟赟赟鹰鹰鹰麟麟麟亿亿川川允允夫夫毛毛功功可可央央幼幼必必旦旦未未由由白白伊伊众众优优伦伦同同囡囡孙孙臣臣至至齐齐吾吾希希张张改改更更灿灿甫甫纬纬芙芙言言轩轩钊钊咏咏姑姑官官宙宙尚尚岳岳征征昇昇昊昊昕昕枝枝枫枫河河玮玮迪迪驹驹亭亭俐俐俭俭冠冠奕奕帮帮挺挺柳柳标标洋洋济济珉珉盈盈省省觉觉选选闻闻娴娴展展恩恩息息晔晔晟晟桃桃真真竞竞舫舫通通钰钰啓啓堃堃婧婧寅寅崇崇晗晗深深焕焕理理甜甜绮绮绵绵绿绿野野铨铨隆隆傅傅博博嵘嵘普普棋棋渭渭焱焱然然琛琛禄禄缘缘萱萱葆葆葱葱裕裕鼎鼎楚楚筱筱解解靖靖魁魁嘉嘉睿睿韬韬影影蕊蕊蕴蕴蝶蝶儒儒樵樵镛镛镜镜霏霏燮燮繁繁巍巍懿懿又上巾彐门马内支斗丝主仪占古台史对巨市汀玄甲艾记丞乔争任伍伏关列在圭地多好庄扣执次池汤玎玑祁羊舟许迈位冶初助吴均妞妤孚岑序库形彤我扶抒攸材杜步求汪汶芦芽评谷身邱里际陈京佶侹典刻垂备居幸性房抱招昆昔杭枚泷玠玫现画畅空竺罗苓苔苹表视诞贯轮郑俞俨勉勋咣咸哞城姝娃将峡带度彪待总战持昱柯洼洽炯狮界畏盼眉祚禹统胤胪茗茜茶荟赴赵逊重钜钟闽音候原唐夏峻换效敖晖校桔桢桧殷流浙浦涌烈烨玺珩祯秦秩称粉致舰莞起都铎阅隽颂婉婵孰寄尉屠常庸得惊惜授敛旋曹梁涯淦烽猗猛球琅皎硕移羚辅逵铜领喆堡媚尊弼惑斯晰最棠棣植滋琨琰紫联舒舜葛装谟谦遂遇链靓鲁嫄微愚慈慎数椿楠楷楸楹槐歆殿溢溪滢煌瑀瑰盟碎蒙裘键雾颐龄嫣稳舆蔷蔺蕖蜀蜜蝉裴褔谱霆韶墀嬉慰樑樟樱潜澄澜璇稼稽豫遵醉镇镐霄题颜冀器壁操潞濒璘璞璟禧翰翱赞霖黔壑曙磻魏黛藩馥攀霭麒鑑";
           Random rd = RandomGenerator.getRandom();
           for (int i = 0; i < k; i++)
           {
               ln = x[rd.Next(1, x.Length)].ToString();
               char n1 = m[rd.Next(1, m.Length)];
               char n2 = m[rd.Next(1, m.Length)];
               rs += ln + n1 + n2;
           }
           return rs;
       }
       public string makeRealNames()
       {
           string rs = ""; string ln = "";
           string x = @"王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周周杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴吴黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄黄刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐徐朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱朱胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡胡沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈沈潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘潘章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章章程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程程方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方方孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙孙郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑郑金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶叶汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何何马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马马赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋蒋俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞俞姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚姚许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许许丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁丁施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施施高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高高余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余余谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢谢董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董董汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤汤钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱钱卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢卢江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江江蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡蔡宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋宋曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹曹邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱邱罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗罗杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜杜郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭郭戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴戴洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐唐袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁袁夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏夏童童童童童童童童童童童童童童童童童童童童童童童童童童肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖肖姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜姜傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅傅范范范范范范范范范范范范范范范范范范范范范范范范顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾顾梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛盛吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕吕诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸诸邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆陆彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭彭韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩韩倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪倪雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷雷郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎郎梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁梁楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼楼万万万万万万万万万万万万万万万万万万龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚龚储储储储储储储储储储储储储储储储储储鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍鲍严严严严严严严严严严严严严严严严严葛葛葛葛葛葛葛葛葛葛葛葛葛葛葛葛葛华华华华华华华华华华华华华华华华应应应应应应应应应应应应应应应应冯冯冯冯冯冯冯冯冯冯冯冯冯冯冯项项项项项项项项项项项项项项项崔崔崔崔崔崔崔崔崔崔崔崔崔崔崔魏魏魏魏魏魏魏魏魏魏魏魏魏魏魏毛毛毛毛毛毛毛毛毛毛毛毛毛毛阮阮阮阮阮阮阮阮阮阮阮阮阮阮邹邹邹邹邹邹邹邹邹邹邹邹邹邹喻喻喻喻喻喻喻喻喻喻喻喻喻喻曾曾曾曾曾曾曾曾曾曾曾曾曾曾邓邓邓邓邓邓邓邓邓邓邓邓邓熊熊熊熊熊熊熊熊熊熊熊熊熊任任任任任任任任任任任任陶陶陶陶陶陶陶陶陶陶陶陶费费费费费费费费费费费凌凌凌凌凌凌凌凌凌凌凌虞虞虞虞虞虞虞虞虞虞虞裘裘裘裘裘裘裘裘裘裘裘涂涂涂涂涂涂涂涂涂涂苏苏苏苏苏苏苏苏苏翁翁翁翁翁翁翁翁翁莫莫莫莫莫莫莫莫莫卞卞卞卞卞卞卞卞史史史史史史史史季季季季季季季季康康康康康康康康管管管管管管管管黎黎黎黎黎黎黎黎孔孔孔孔孔孔孔田田田田田田田单单单单单单单娄娄娄娄娄娄娄宣宣宣宣宣宣宣钟钟钟钟钟钟钟饶饶饶饶饶饶饶鲁鲁鲁鲁鲁鲁鲁廖廖廖廖廖廖廖于于于于于于韦韦韦韦韦韦甘甘甘甘甘甘石石石石石石孟孟孟孟孟孟柳柳柳柳柳柳祝祝祝祝祝祝胥胥胥胥胥胥殷殷殷殷殷殷舒舒舒舒舒舒褚褚褚褚褚褚薛薛薛薛薛薛白白白白白向向向向向邬邬邬邬邬尚尚尚尚尚竺竺竺竺竺查查查查查谈谈谈谈谈贾贾贾贾贾温温温温温游游游游游谭谭谭谭谭开开开开伍伍伍伍庄庄庄庄成成成成沙沙沙沙柏柏柏柏郝郝郝郝秦秦秦秦尉尉尉尉麻麻麻麻詹詹詹詹赖赖赖赖裴裴裴裴颜颜颜颜尹尹尹巴巴巴乐乐乐厉厉厉谷谷谷易易易段段段钮钮钮骆骆骆笪笪笪阎阎阎缪缪缪臧臧臧樊樊樊操操操卜卜丰丰文文水水兰兰包包平平乔乔伊伊有有牟牟邢邢劳劳来来求求沃沃芮芮闵闵欧欧郏郏柯柯贺贺闻闻桂桂耿耿戚戚符符蓝蓝路路阚阚滕滕霍霍上卫干支牛计车左申艾仲刑匡印吉宇安戎毕池纪过佘冷时束花迟邰卓宓宗官庞於明练苗茅郁冒洑相郤郦钦奚席晋晏柴聂宿密屠常鄂惠琚窦简蒿阙穆濮";
           string m = @"华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋世世世世世世世世世世世世世世世世世世世世世世世世世世世世世世世有有有有有有有有有有有有有有有有有有有有有有有有有有有有有有有佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳立立立立立立立立立立立立立立立立立立立立立立立立立立立立立立家家家家家家家家家家家家家家家家家家家家家家家家家家家家家家清清清清清清清清清清清清清清清清清清清清清清清清清清清清清清义义义义义义义义义义义义义义义义义义义义义义义义义义义义义丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹正正正正正正正正正正正正正正正正正正正正正正正正正正正正正宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳银银银银银银银银银银银银银银银银银银银银银银银银银银银银银贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤培培培培培培培培培培培培培培培培培培培培培培培培培培培培锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋中中中中中中中中中中中中中中中中中中中中中中中中中中中仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁元元元元元元元元元元元元元元元元元元元元元元元元元元元香香香香香香香香香香香香香香香香香香香香香香香香香香香长长长长长长长长长长长长长长长长长长长长长长长长长长如如如如如如如如如如如如如如如如如如如如如如如如如如花花花花花花花花花花花花花花花花花花花花花花花花花花才才才才才才才才才才才才才才才才才才才才才才才才才友友友友友友友友友友友友友友友友友友友友友友友友友刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚利利利利利利利利利利利利利利利利利利利利利利利利利连连连连连连连连连连连连连连连连连连连连连连连连连东东东东东东东东东东东东东东东东东东东东东东东东江江江江江江江江江江江江江江江江江江江江江江江江洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜君君君君君君君君君君君君君君君君君君君君君君君昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊星星星星星星星星星星星星星星星星星星星星星星星光光光光光光光光光光光光光光光光光光光光光光波波波波波波波波波波波波波波波波波波波波波波顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷一一一一一一一一一一一一一一一一一一一一一和和和和和和和和和和和和和和和和和和和和和康康康康康康康康康康康康康康康康康康康康康吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙发发发发发发发发发发发发发发发发发发发杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉静静静静静静静静静静静静静静静静静静静传传传传传传传传传传传传传传传传传传欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵振振振振振振振振振振振振振振振振振振维维维维维维维维维维维维维维维维维维晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉双双双双双双双双双双双双双双双双双方方方方方方方方方方方方方方方方方礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼松松松松松松松松松松松松松松松松松彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑来来来来来来来来来来来来来来来来涛涛涛涛涛涛涛涛涛涛涛涛涛涛涛涛素素素素素素素素素素素素素素素素莹莹莹莹莹莹莹莹莹莹莹莹莹莹莹莹超超超超超超超超超超超超超超超超木木木木木木木木木木木木木木木芸芸芸芸芸芸芸芸芸芸芸芸芸芸芸武武武武武武武武武武武武武武武浩浩浩浩浩浩浩浩浩浩浩浩浩浩浩道道道道道道道道道道道道道道道天天天天天天天天天天天天天天冬冬冬冬冬冬冬冬冬冬冬冬冬冬巧巧巧巧巧巧巧巧巧巧巧巧巧巧先先先先先先先先先先先先先先宗宗宗宗宗宗宗宗宗宗宗宗宗宗泽泽泽泽泽泽泽泽泽泽泽泽泽泽娜娜娜娜娜娜娜娜娜娜娜娜娜娜虹虹虹虹虹虹虹虹虹虹虹虹虹虹能能能能能能能能能能能能能能善善善善善善善善善善善善善善瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫开开开开开开开开开开开开开加加加加加加加加加加加加加汉汉汉汉汉汉汉汉汉汉汉汉汉全全全全全全全全全全全全全远远远远远远远远远远远远远坤坤坤坤坤坤坤坤坤坤坤坤坤炎炎炎炎炎炎炎炎炎炎炎炎炎树树树树树树树树树树树树树泉泉泉泉泉泉泉泉泉泉泉泉泉珏珏珏珏珏珏珏珏珏珏珏珏珏继继继继继继继继继继继继继高高高高高高高高高高高高高鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿景景景景景景景景景景景景景为为为为为为为为为为为为叶叶叶叶叶叶叶叶叶叶叶叶宇宇宇宇宇宇宇宇宇宇宇宇年年年年年年年年年年年年孝孝孝孝孝孝孝孝孝孝孝孝寿寿寿寿寿寿寿寿寿寿寿寿苗苗苗苗苗苗苗苗苗苗苗苗虎虎虎虎虎虎虎虎虎虎虎虎洁洁洁洁洁洁洁洁洁洁洁洁益益益益益益益益益益益益智智智智智智智智智智智智森森森森森森森森森森森森琼琼琼琼琼琼琼琼琼琼琼琼雅雅雅雅雅雅雅雅雅雅雅雅源源源源源源源源源源源源鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏士士士士士士士士士士士山山山山山山山山山山山丰丰丰丰丰丰丰丰丰丰丰乐乐乐乐乐乐乐乐乐乐乐冰冰冰冰冰冰冰冰冰冰冰克克克克克克克克克克克杏杏杏杏杏杏杏杏杏杏杏定定定定定定定定定定定承承承承承承承承承承承绍绍绍绍绍绍绍绍绍绍绍政政政政政政政政政政政倩倩倩倩倩倩倩倩倩倩倩健健健健健健健健健健健锡锡锡锡锡锡锡锡锡锡锡锦锦锦锦锦锦锦锦锦锦锦黎黎黎黎黎黎黎黎黎黎黎耀耀耀耀耀耀耀耀耀耀耀三三三三三三三三三三阳阳阳阳阳阳阳阳阳阳佩佩佩佩佩佩佩佩佩佩剑剑剑剑剑剑剑剑剑剑姣姣姣姣姣姣姣姣姣姣珊珊珊珊珊珊珊珊珊珊章章章章章章章章章章铭铭铭铭铭铭铭铭铭铭瑞瑞瑞瑞瑞瑞瑞瑞瑞瑞碧碧碧碧碧碧碧碧碧碧翠翠翠翠翠翠翠翠翠翠瑾瑾瑾瑾瑾瑾瑾瑾瑾瑾土土土土土土土土土少少少少少少少少少行行行行行行行行行伯伯伯伯伯伯伯伯伯坚坚坚坚坚坚坚坚坚阿阿阿阿阿阿阿阿阿其其其其其其其其其奇奇奇奇奇奇奇奇奇妹妹妹妹妹妹妹妹妹怡怡怡怡怡怡怡怡怡炜炜炜炜炜炜炜炜炜南南南南南南南南南品品品品品品品品品盛盛盛盛盛盛盛盛盛菲菲菲菲菲菲菲菲菲雄雄雄雄雄雄雄雄雄意意意意意意意意意璐璐璐璐璐璐璐璐璐人人人人人人人人久久久久久久久久大大大大大大大大风风风风风风风风仲仲仲仲仲仲仲仲向向向向向向向向达达达达达达达达启启启启启启启启时时时时时时时时欣欣欣欣欣欣欣欣茂茂茂茂茂茂茂茂钦钦钦钦钦钦钦钦卿卿卿卿卿卿卿卿翔翔翔翔翔翔翔翔九九九九九九九广广广广广广广心心心心心心心代代代代代代代亦亦亦亦亦亦亦存存存存存存存师师师师师师师纪纪纪纪纪纪纪芝芝芝芝芝芝芝李李李李李李李灵灵灵灵灵灵灵纯纯纯纯纯纯纯苏苏苏苏苏苏苏迎迎迎迎迎迎迎秉秉秉秉秉秉秉诚诚诚诚诚诚诚奎奎奎奎奎奎奎娇娇娇娇娇娇娇显显显显显显显祖祖祖祖祖祖祖哲哲哲哲哲哲哲荷荷荷荷荷荷荷基基基基基基基珺珺珺珺珺珺珺琦琦琦琦琦琦琦熙熙熙熙熙熙熙蕾蕾蕾蕾蕾蕾蕾万万万万万万子子子子子子火火火火火火以以以以以以圣圣圣圣圣圣宁宁宁宁宁宁兆兆兆兆兆兆权权权权权权竹竹竹竹竹竹自自自自自自观观观观观观贞贞贞贞贞贞妙妙妙妙妙妙怀怀怀怀怀怀妮妮妮妮妮妮育育育育育育彦彦彦彦彦彦恒恒恒恒恒恒栋栋栋栋栋栋堂堂堂堂堂堂婕婕婕婕婕婕湘湘湘湘湘湘照照照照照照瑜瑜瑜瑜瑜瑜韵韵韵韵韵韵毓毓毓毓毓毓豪豪豪豪豪豪毅毅毅毅毅毅潮潮潮潮潮潮力力力力力之之之之之五五五五五从从从从从升升升升升太太太太太引引引引引业业业业业本本本本本田田田田田名名名名名守守守守守扬扬扬扬扬汝汝汝汝汝百百百百百妍妍妍妍妍岚岚岚岚岚男男男男男财财财财财进进进进进凯凯凯凯凯周周周周周宜宜宜宜宜放放放放放旺旺旺旺旺经经经经经雨雨雨雨雨保保保保保信信信信信娅娅娅娅娅庭庭庭庭庭思思思思思钢钢钢钢钢钧钧钧钧钧凌凌凌凌凌圆圆圆圆圆宽宽宽宽宽宾宾宾宾宾笑笑笑笑笑骏骏骏骏骏跃跃跃跃跃斐斐斐斐斐朝朝朝朝朝煜煜煜煜煜增增增增增震震震震震鹤鹤鹤鹤鹤衡衡衡衡衡艺艺艺艺尔尔尔尔申申申申尧尧尧尧作作作作园园园园声声声声陆陆陆陆卓卓卓卓孟孟孟孟昉昉昉昉治治治治知知知知祎祎祎祎郁郁郁郁钖钖钖钖修修修修复复复复威威威威柏柏柏柏洲洲洲洲相相相相科科科科晋晋晋晋润润润润航航航航莎莎莎莎铁铁铁铁乾乾乾乾晨晨晨晨望望望望梦梦梦梦涵涵涵涵象象象象逸逸逸逸媛媛媛媛敬敬敬敬腊腊腊腊滨滨滨滨雷雷雷雷蔚蔚蔚蔚磊磊磊磊露露露露乃乃乃于于于女女女工工工书书书公公公六六六历历历日日日贝贝贝仕仕仕令令令北北北四四四石石石再再再农农农则则则吕吕吕延延延聿聿聿亨亨亨余余余呈呈呈应应应社社社芹芹芹运运运依依依姐姐姐姗姗姗季季季岩岩岩玥玥玥诗诗诗厚厚厚垚垚垚宣宣宣宪宪宪峥峥峥映映映柱柱柱炼炼炼茹茹茹贻贻贻轶轶轶容容容悦悦悦梧梧梧泰泰泰积积积耕耕耕莺莺莺谊谊谊逢逢逢铃铃铃梓梓梓渊渊渊爽爽爽绪绪绪敦敦敦淼淼淼琪琪琪登登登程程程越越越雁雁雁雯雯雯雲雲雲嵩嵩嵩满满满筠筠筠蓓蓓蓓路路路旗旗旗熊熊熊瑶瑶瑶璋璋璋聪聪聪镕镕镕薇薇薇赟赟赟鹰鹰鹰麟麟麟亿亿川川允允夫夫毛毛功功可可央央幼幼必必旦旦未未由由白白伊伊众众优优伦伦同同囡囡孙孙臣臣至至齐齐吾吾希希张张改改更更灿灿甫甫纬纬芙芙言言轩轩钊钊咏咏姑姑官官宙宙尚尚岳岳征征昇昇昊昊昕昕枝枝枫枫河河玮玮迪迪驹驹亭亭俐俐俭俭冠冠奕奕帮帮挺挺柳柳标标洋洋济济珉珉盈盈省省觉觉选选闻闻娴娴展展恩恩息息晔晔晟晟桃桃真真竞竞舫舫通通钰钰啓啓堃堃婧婧寅寅崇崇晗晗深深焕焕理理甜甜绮绮绵绵绿绿野野铨铨隆隆傅傅博博嵘嵘普普棋棋渭渭焱焱然然琛琛禄禄缘缘萱萱葆葆葱葱裕裕鼎鼎楚楚筱筱解解靖靖魁魁嘉嘉睿睿韬韬影影蕊蕊蕴蕴蝶蝶儒儒樵樵镛镛镜镜霏霏燮燮繁繁巍巍懿懿又上巾彐门马内支斗丝主仪占古台史对巨市汀玄甲艾记丞乔争任伍伏关列在圭地多好庄扣执次池汤玎玑祁羊舟许迈位冶初助吴均妞妤孚岑序库形彤我扶抒攸材杜步求汪汶芦芽评谷身邱里际陈京佶侹典刻垂备居幸性房抱招昆昔杭枚泷玠玫现画畅空竺罗苓苔苹表视诞贯轮郑俞俨勉勋咣咸哞城姝娃将峡带度彪待总战持昱柯洼洽炯狮界畏盼眉祚禹统胤胪茗茜茶荟赴赵逊重钜钟闽音候原唐夏峻换效敖晖校桔桢桧殷流浙浦涌烈烨玺珩祯秦秩称粉致舰莞起都铎阅隽颂婉婵孰寄尉屠常庸得惊惜授敛旋曹梁涯淦烽猗猛球琅皎硕移羚辅逵铜领喆堡媚尊弼惑斯晰最棠棣植滋琨琰紫联舒舜葛装谟谦遂遇链靓鲁嫄微愚慈慎数椿楠楷楸楹槐歆殿溢溪滢煌瑀瑰盟碎蒙裘键雾颐龄嫣稳舆蔷蔺蕖蜀蜜蝉裴褔谱霆韶墀嬉慰樑樟樱潜澄澜璇稼稽豫遵醉镇镐霄题颜冀器壁操潞濒璘璞璟禧翰翱赞霖黔壑曙磻魏黛藩馥攀霭麒鑑";
           Random rd = RandomGenerator.getRandom();

           ln = x[rd.Next(1, x.Length)].ToString();
           string n1 = m[rd.Next(1, m.Length)].ToString();
           string n2 = m[rd.Next(1, m.Length)].ToString();
           int irate = rd.Next(10);
           if (irate < 3)
           {
               n1 = "";
           }
           rs += ln + n1 + n2;
           return rs;
       }
       //生成高仿真单位与机构名称:
       public string makeRealOrgNames(int k)
       {
           string rs = ""; string on = "";
           string m = @"华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华华明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明明芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳芳琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴琴红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红红萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍萍文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽丽金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金金荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣荣国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国国英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英英珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍珍月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月月云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云云平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平平美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美美海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海海林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林林志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志志玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉玉建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建建伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟伟春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春春玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲玲晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓晓爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀秀霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞霞燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕燕根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根根新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新新凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤凤德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德德成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成成敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏敏生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生生民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民民小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小小亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚亚梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅梅强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强强忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠忠军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军军良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良良永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永永飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪雪芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬芬莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲莲宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝宝娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣娣斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌斌水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水水兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰兰祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥祥学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学学勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇勇福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福福娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟娟峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰峰菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊菊青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青青桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂桂卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫卫富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富富龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙龙贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵贵娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥娥莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉莉彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩彩兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴兴安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安安慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧慧珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠珠庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆庆旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭旭法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法法艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳艳惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠惠群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群群秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋秋世世世世世世世世世世世世世世世世世世世世世世世世世世世世世世世有有有有有有有有有有有有有有有有有有有有有有有有有有有有有有有佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳佳立立立立立立立立立立立立立立立立立立立立立立立立立立立立立立家家家家家家家家家家家家家家家家家家家家家家家家家家家家家家清清清清清清清清清清清清清清清清清清清清清清清清清清清清清清义义义义义义义义义义义义义义义义义义义义义义义义义义义义义丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹丹正正正正正正正正正正正正正正正正正正正正正正正正正正正正正宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏宏炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳炳银银银银银银银银银银银银银银银银银银银银银银银银银银银银银贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤贤培培培培培培培培培培培培培培培培培培培培培培培培培培培培锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋锋中中中中中中中中中中中中中中中中中中中中中中中中中中中仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁仁元元元元元元元元元元元元元元元元元元元元元元元元元元元香香香香香香香香香香香香香香香香香香香香香香香香香香香长长长长长长长长长长长长长长长长长长长长长长长长长长如如如如如如如如如如如如如如如如如如如如如如如如如如花花花花花花花花花花花花花花花花花花花花花花花花花花才才才才才才才才才才才才才才才才才才才才才才才才才友友友友友友友友友友友友友友友友友友友友友友友友友刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚刚利利利利利利利利利利利利利利利利利利利利利利利利利连连连连连连连连连连连连连连连连连连连连连连连连连东东东东东东东东东东东东东东东东东东东东东东东东江江江江江江江江江江江江江江江江江江江江江江江江洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪洪胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜胜君君君君君君君君君君君君君君君君君君君君君君君昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌昌俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊俊星星星星星星星星星星星星星星星星星星星星星星星光光光光光光光光光光光光光光光光光光光光光光波波波波波波波波波波波波波波波波波波波波波波顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺顺婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷婷一一一一一一一一一一一一一一一一一一一一一和和和和和和和和和和和和和和和和和和和和和康康康康康康康康康康康康康康康康康康康康康吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉吉亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮亮喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜喜琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳琳颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖颖仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙仙发发发发发发发发发发发发发发发发发发发杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰杰鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣鸣勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤勤蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉蓉静静静静静静静静静静静静静静静静静静静传传传传传传传传传传传传传传传传传传欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢欢兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵兵振振振振振振振振振振振振振振振振振振维维维维维维维维维维维维维维维维维维晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶晶辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉辉双双双双双双双双双双双双双双双双双方方方方方方方方方方方方方方方方方礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼礼松松松松松松松松松松松松松松松松松彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬彬淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑淑来来来来来来来来来来来来来来来来涛涛涛涛涛涛涛涛涛涛涛涛涛涛涛涛素素素素素素素素素素素素素素素素莹莹莹莹莹莹莹莹莹莹莹莹莹莹莹莹超超超超超超超超超超超超超超超超木木木木木木木木木木木木木木木芸芸芸芸芸芸芸芸芸芸芸芸芸芸芸武武武武武武武武武武武武武武武浩浩浩浩浩浩浩浩浩浩浩浩浩浩浩道道道道道道道道道道道道道道道天天天天天天天天天天天天天天冬冬冬冬冬冬冬冬冬冬冬冬冬冬巧巧巧巧巧巧巧巧巧巧巧巧巧巧先先先先先先先先先先先先先先宗宗宗宗宗宗宗宗宗宗宗宗宗宗泽泽泽泽泽泽泽泽泽泽泽泽泽泽娜娜娜娜娜娜娜娜娜娜娜娜娜娜虹虹虹虹虹虹虹虹虹虹虹虹虹虹能能能能能能能能能能能能能能善善善善善善善善善善善善善善瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛瑛鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫鑫开开开开开开开开开开开开开加加加加加加加加加加加加加汉汉汉汉汉汉汉汉汉汉汉汉汉全全全全全全全全全全全全全远远远远远远远远远远远远远坤坤坤坤坤坤坤坤坤坤坤坤坤炎炎炎炎炎炎炎炎炎炎炎炎炎树树树树树树树树树树树树树泉泉泉泉泉泉泉泉泉泉泉泉泉珏珏珏珏珏珏珏珏珏珏珏珏珏继继继继继继继继继继继继继高高高高高高高高高高高高高鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿鸿景景景景景景景景景景景景景为为为为为为为为为为为为叶叶叶叶叶叶叶叶叶叶叶叶宇宇宇宇宇宇宇宇宇宇宇宇年年年年年年年年年年年年孝孝孝孝孝孝孝孝孝孝孝孝寿寿寿寿寿寿寿寿寿寿寿寿苗苗苗苗苗苗苗苗苗苗苗苗虎虎虎虎虎虎虎虎虎虎虎虎洁洁洁洁洁洁洁洁洁洁洁洁益益益益益益益益益益益益智智智智智智智智智智智智森森森森森森森森森森森森琼琼琼琼琼琼琼琼琼琼琼琼雅雅雅雅雅雅雅雅雅雅雅雅源源源源源源源源源源源源鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏鹏士士士士士士士士士士士山山山山山山山山山山山丰丰丰丰丰丰丰丰丰丰丰乐乐乐乐乐乐乐乐乐乐乐冰冰冰冰冰冰冰冰冰冰冰克克克克克克克克克克克杏杏杏杏杏杏杏杏杏杏杏定定定定定定定定定定定承承承承承承承承承承承绍绍绍绍绍绍绍绍绍绍绍政政政政政政政政政政政倩倩倩倩倩倩倩倩倩倩倩健健健健健健健健健健健锡锡锡锡锡锡锡锡锡锡锡锦锦锦锦锦锦锦锦锦锦锦黎黎黎黎黎黎黎黎黎黎黎耀耀耀耀耀耀耀耀耀耀耀三三三三三三三三三三阳阳阳阳阳阳阳阳阳阳佩佩佩佩佩佩佩佩佩佩剑剑剑剑剑剑剑剑剑剑姣姣姣姣姣姣姣姣姣姣珊珊珊珊珊珊珊珊珊珊章章章章章章章章章章铭铭铭铭铭铭铭铭铭铭瑞瑞瑞瑞瑞瑞瑞瑞瑞瑞碧碧碧碧碧碧碧碧碧碧翠翠翠翠翠翠翠翠翠翠瑾瑾瑾瑾瑾瑾瑾瑾瑾瑾土土土土土土土土土少少少少少少少少少行行行行行行行行行伯伯伯伯伯伯伯伯伯坚坚坚坚坚坚坚坚坚阿阿阿阿阿阿阿阿阿其其其其其其其其其奇奇奇奇奇奇奇奇奇妹妹妹妹妹妹妹妹妹怡怡怡怡怡怡怡怡怡炜炜炜炜炜炜炜炜炜南南南南南南南南南品品品品品品品品品盛盛盛盛盛盛盛盛盛菲菲菲菲菲菲菲菲菲雄雄雄雄雄雄雄雄雄意意意意意意意意意璐璐璐璐璐璐璐璐璐人人人人人人人人久久久久久久久久大大大大大大大大风风风风风风风风仲仲仲仲仲仲仲仲向向向向向向向向达达达达达达达达启启启启启启启启时时时时时时时时欣欣欣欣欣欣欣欣茂茂茂茂茂茂茂茂钦钦钦钦钦钦钦钦卿卿卿卿卿卿卿卿翔翔翔翔翔翔翔翔九九九九九九九广广广广广广广心心心心心心心代代代代代代代亦亦亦亦亦亦亦存存存存存存存师师师师师师师纪纪纪纪纪纪纪芝芝芝芝芝芝芝李李李李李李李灵灵灵灵灵灵灵纯纯纯纯纯纯纯苏苏苏苏苏苏苏迎迎迎迎迎迎迎秉秉秉秉秉秉秉诚诚诚诚诚诚诚奎奎奎奎奎奎奎娇娇娇娇娇娇娇显显显显显显显祖祖祖祖祖祖祖哲哲哲哲哲哲哲荷荷荷荷荷荷荷基基基基基基基珺珺珺珺珺珺珺琦琦琦琦琦琦琦熙熙熙熙熙熙熙蕾蕾蕾蕾蕾蕾蕾万万万万万万子子子子子子火火火火火火以以以以以以圣圣圣圣圣圣宁宁宁宁宁宁兆兆兆兆兆兆权权权权权权竹竹竹竹竹竹自自自自自自观观观观观观贞贞贞贞贞贞妙妙妙妙妙妙怀怀怀怀怀怀妮妮妮妮妮妮育育育育育育彦彦彦彦彦彦恒恒恒恒恒恒栋栋栋栋栋栋堂堂堂堂堂堂婕婕婕婕婕婕湘湘湘湘湘湘照照照照照照瑜瑜瑜瑜瑜瑜韵韵韵韵韵韵毓毓毓毓毓毓豪豪豪豪豪豪毅毅毅毅毅毅潮潮潮潮潮潮力力力力力之之之之之五五五五五从从从从从升升升升升太太太太太引引引引引业业业业业本本本本本田田田田田名名名名名守守守守守扬扬扬扬扬汝汝汝汝汝百百百百百妍妍妍妍妍岚岚岚岚岚男男男男男财财财财财进进进进进凯凯凯凯凯周周周周周宜宜宜宜宜放放放放放旺旺旺旺旺经经经经经雨雨雨雨雨保保保保保信信信信信娅娅娅娅娅庭庭庭庭庭思思思思思钢钢钢钢钢钧钧钧钧钧凌凌凌凌凌圆圆圆圆圆宽宽宽宽宽宾宾宾宾宾笑笑笑笑笑骏骏骏骏骏跃跃跃跃跃斐斐斐斐斐朝朝朝朝朝煜煜煜煜煜增增增增增震震震震震鹤鹤鹤鹤鹤衡衡衡衡衡艺艺艺艺尔尔尔尔申申申申尧尧尧尧作作作作园园园园声声声声陆陆陆陆卓卓卓卓孟孟孟孟昉昉昉昉治治治治知知知知祎祎祎祎郁郁郁郁钖钖钖钖修修修修复复复复威威威威柏柏柏柏洲洲洲洲相相相相科科科科晋晋晋晋润润润润航航航航莎莎莎莎铁铁铁铁乾乾乾乾晨晨晨晨望望望望梦梦梦梦涵涵涵涵象象象象逸逸逸逸媛媛媛媛敬敬敬敬腊腊腊腊滨滨滨滨雷雷雷雷蔚蔚蔚蔚磊磊磊磊露露露露乃乃乃于于于女女女工工工书书书公公公六六六历历历日日日贝贝贝仕仕仕令令令北北北四四四石石石再再再农农农则则则吕吕吕延延延聿聿聿亨亨亨余余余呈呈呈应应应社社社芹芹芹运运运依依依姐姐姐姗姗姗季季季岩岩岩玥玥玥诗诗诗厚厚厚垚垚垚宣宣宣宪宪宪峥峥峥映映映柱柱柱炼炼炼茹茹茹贻贻贻轶轶轶容容容悦悦悦梧梧梧泰泰泰积积积耕耕耕莺莺莺谊谊谊逢逢逢铃铃铃梓梓梓渊渊渊爽爽爽绪绪绪敦敦敦淼淼淼琪琪琪登登登程程程越越越雁雁雁雯雯雯雲雲雲嵩嵩嵩满满满筠筠筠蓓蓓蓓路路路旗旗旗熊熊熊瑶瑶瑶璋璋璋聪聪聪镕镕镕薇薇薇赟赟赟鹰鹰鹰麟麟麟亿亿川川允允夫夫毛毛功功可可央央幼幼必必旦旦未未由由白白伊伊众众优优伦伦同同囡囡孙孙臣臣至至齐齐吾吾希希张张改改更更灿灿甫甫纬纬芙芙言言轩轩钊钊咏咏姑姑官官宙宙尚尚岳岳征征昇昇昊昊昕昕枝枝枫枫河河玮玮迪迪驹驹亭亭俐俐俭俭冠冠奕奕帮帮挺挺柳柳标标洋洋济济珉珉盈盈省省觉觉选选闻闻娴娴展展恩恩息息晔晔晟晟桃桃真真竞竞舫舫通通钰钰啓啓堃堃婧婧寅寅崇崇晗晗深深焕焕理理甜甜绮绮绵绵绿绿野野铨铨隆隆傅傅博博嵘嵘普普棋棋渭渭焱焱然然琛琛禄禄缘缘萱萱葆葆葱葱裕裕鼎鼎楚楚筱筱解解靖靖魁魁嘉嘉睿睿韬韬影影蕊蕊蕴蕴蝶蝶儒儒樵樵镛镛镜镜霏霏燮燮繁繁巍巍懿懿又上巾彐门马内支斗丝主仪占古台史对巨市汀玄甲艾记丞乔争任伍伏关列在圭地多好庄扣执次池汤玎玑祁羊舟许迈位冶初助吴均妞妤孚岑序库形彤我扶抒攸材杜步求汪汶芦芽评谷身邱里际陈京佶侹典刻垂备居幸性房抱招昆昔杭枚泷玠玫现画畅空竺罗苓苔苹表视诞贯轮郑俞俨勉勋咣咸哞城姝娃将峡带度彪待总战持昱柯洼洽炯狮界畏盼眉祚禹统胤胪茗茜茶荟赴赵逊重钜钟闽音候原唐夏峻换效敖晖校桔桢桧殷流浙浦涌烈烨玺珩祯秦秩称粉致舰莞起都铎阅隽颂婉婵孰寄尉屠常庸得惊惜授敛旋曹梁涯淦烽猗猛球琅皎硕移羚辅逵铜领喆堡媚尊弼惑斯晰最棠棣植滋琨琰紫联舒舜葛装谟谦遂遇链靓鲁嫄微愚慈慎数椿楠楷楸楹槐歆殿溢溪滢煌瑀瑰盟碎蒙裘键雾颐龄嫣稳舆蔷蔺蕖蜀蜜蝉裴褔谱霆韶墀嬉慰樑樟樱潜澄澜璇稼稽豫遵醉镇镐霄题颜冀器壁操潞濒璘璞璟禧翰翱赞霖黔壑曙磻魏黛藩馥攀霭麒鑑";
           string[] org = { "公司", "集团", "商店", "酒店", "旅馆", "研究所", "设计院", "工作站", "酒家", "大厦", "服务部", "实业公司", "有限公司" };
           Random rd = RandomGenerator.getRandom();
           for (int i = 0; i < k; i++)
           {
               on = org[rd.Next(0, org.Length)];
               char n1 = m[rd.Next(1, m.Length)];
               char n2 = m[rd.Next(1, m.Length)];
               rs += n1.ToString() + n2.ToString() + on + ",";
           }
           return rs;
       }

       //从一级GBK字库中取字:
       public string makeGBKNamesBy3755(int k, string lastName)
       {
           string rs = "";
           Random rd = RandomGenerator.getRandom();
           string w3755 = GBK3755();
           for (int i = 0; i < k; i++)
           {
               int r1 = rd.Next(0, 3755);
               string n1 = w3755.Substring(r1, 1);
               int r2 = rd.Next(0, 3755);
               string n2 = w3755.Substring(r2, 1);
               rs += lastName + n1 + n2 + ",";
           }
           return rs;
       }

       //从二级GBK字库中取字:
       public string makeGBKNamesBy3008(int k, string lastName)
       {
           string rs = "";
           Random rd = RandomGenerator.getRandom();
           string w3008 = GBK3008();
           for (int i = 0; i < k; i++)
           {
               int r1 = rd.Next(0, 3008);
               string n1 = w3008.Substring(r1, 1);
               int r2 = rd.Next(0, 3008);
               string n2 = w3008.Substring(r2, 1);
               rs += lastName + n1 + n2;
           }
           return rs;
       }

       //从一级Unicode字库中取字:
       public string makeUnicodeNames(int k, string lastName)
       {
           string rs = "";
           Random rd = RandomGenerator.getRandom();
           for (int i = 0; i < k; i++)
           {
               long r1 = rd.Next(19968, 19968 + 20902);
               char n1 = (char)r1;
               long r2 = rd.Next(19968, 19968 + 20902);
               char n2 = (char)r2;
               rs += lastName + n1 + n2 + ",";
           }
           return rs;
       }

       //一级GBK字库:
       public string GBK3755()
       {
           byte[] bt; string rlt = "";
           for (byte i = 160 + 16; i <= 160 + 54; i++)
           {
               for (byte j = 160 + 1; j <= 160 + 94; j++)
               {
                   bt = new byte[] { i, j };
                   string str = Encoding.GetEncoding("GBK").GetString(bt);
                   rlt += str;
               }
           }
           for (byte j = 160 + 1; j <= 160 + 90; j++)
           {
               bt = new byte[] { 160 + 55, j };
               string str = Encoding.GetEncoding("GBK").GetString(bt);
               rlt += str;
           }
           return rlt;
       }

       //二级GBK字库:
       public string GBK3008()
       {
           byte[] bt; string rlt = "";
           for (byte i = 160 + 56; i <= 160 + 87; i++)
           {
               for (byte j = 160 + 1; j <= 160 + 94; j++)
               {
                   bt = new byte[] { i, j };
                   string str = Encoding.GetEncoding("GBK").GetString(bt);
                   rlt += str;
               }
           }
           return rlt;
       }
   }
}
